# AnalyticalLinkReleaseTranslationZ Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalLinkReleaseTranslationZ Property
ParameterTypeId Class See Also
---
"Z Translation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalLinkReleaseTranslationZ { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalLinkReleaseTranslationZ As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalLinkReleaseTranslationZ {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace